// 정리.cs

// C# 에서 알아야 하는 것

// 1. 대부분의 프로그래밍 언어가 제공하는 개념을 C# 은 어떻게 표현하는가 ?
// => 데이타 타입, 변수 생성
// => 함수 만드는 방법
// => 배열, 튜플 만드는 방법, 사용법
// => 제어문(조건문 : if, switch,  반복문 4개 : while, do-while, for, foreach)
// => 1일차에 배운것들
//---------------------------------------------------------------------------

// 2. 객체지향 언어 문법(C++, C#, Java 등에서 공통으로 사용되는 문법)
// => 객체지향 언어 : 필요한 타입을 먼저 만들어서 사용하자는 철학을 가진 언어
//                   (C++, C#, Java 는 100% 객체지향 언어)
//                   (Python, Rust 등은 완벽한 객체지향 언어는 아님)

// => 타입을 만드는 방법(class 문법)
// => 만들어진 타입을 잘 사용하는 방법(ex : WPF 라이브러리의 Window 타입 사용법등..)


// 3. C# 만이 가진 특징
// => Delegate, Property 등의 핵심 문법

// #4. 라이브러리 활용해서 프로그램 작성
// => 기본 라이브러리
// => WPF 라이브러리 등. 